Repository: 84000/data-translation-memory
Catalog: toh229-v4.tmx
Source language: bo
Languages: en

source: །རྒྱལ་པོ་རྒྱལ་རིགས་གང་ཞིག་ནི། །ཆོས་ཀྱི་དམ་པ་ཚོལ་འདོད་པ། །ཡང་དང་ཡང་དུ་ཆོས་ཀྱི་མཆོག །ཆོས་བཞི་པོ་ལ་སྟེན་པར་བྱོས།
en: A king of the kṣatriyas Who wishes to pursue the highest teaching Must adhere to these four principles, The supreme teaching, again and again. “

source: །རྒྱལ་པོ་ཆེན་པོ་གཞན་ཡང་མཆོག་འོས་ནི་སེམས་ཅན་རྣམས་ཀྱི་ཕྱིར་ཆོས་ཀྱི་མཆོག་རྣམ་པར་འབྱེད་དོ།
en: Furthermore, great king, with regard to what is supreme and suitable, I shall now explain the supreme teaching in order to benefit beings.

source: །རྒྱལ་པོ་ཆེན་པོ་ཆོས་ཀྱི་མཆོག་གང་ཞེ་ན།
en: Great king, what is the supreme teaching?

source: རྒྱལ་པོ་ཆེན་པོ་ཆོས་ཀྱི་མཆོག་ནི་ཆོས་ཐམས་ཅད་གཟུང་བར་བྱ་བ་མ་ཡིན་པའོ།
en: Great king, the supreme teaching is that all phenomena are inconceivable.

source: །སུས་གཟུང་བར་བྱ་བ་མ་ཡིན་ཞེ་ན།
en: Who cannot conceive of them?

source: །རྒྱལ་པོ་ཆེན་པོ་སུས་ཀྱང་མི་འཛིན་པ་དེའི་ཕྱིར་ཆོས་ཐམས་ཅད་གཟུང་བར་བྱ་བ་མ་ཡིན་ནོ་ཞེས་བྱའོ།
en: Great king, they cannot be conceived of by anyone at all; that is why it is said that all phenomena are inconceivable.

source: །རྒྱལ་པོ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ཆོས་ཐམས་ཅད་ཅེས་བྱ་བ་ཇི་ལྟ་བུ་ཞེ་ན།
en: Great king, what is meant when we speak of all phenomena?

source: རྒྱལ་པོ་ཆེན་པོ་ཆོས་དེ་དག་ཐམས་ཅད་ནི་ཆོས་མ་ཡིན་ཏེ།
en: Great king, all those phenomena are not phenomena.

source: དེས་ན་ཆོས་ཐམས་ཅད་ཆོས་ཐམས་ཅད་ཅེས་བྱའོ།
en: Therefore, all phenomena are known as all phenomena.

source: །དེ་དག་ཆོས་མ་ཡིན་པ་ཇི་ལྟ་བུ་ཞེ་ན།
en: In what way are they not phenomena?

source: རྒྱལ་པོ་ཆེན་པོ་གང་ཇི་ཙམ་དུ་སྤྱོད་པ་དེ་ཙམ་དུ་ཆོས་ཀྱི་འདུ་ཤེས་མ་ཡིན་ནོ།
en: Great king, the more you engage with them, the more you do not conceive of them as phenomena.

source: །རྒྱལ་པོ་ཆེན་པོ་ཆོས་ཀྱི་འདུ་ཤེས་མ་ཡིན་པ་ཞེས་བྱ་བ་ནི་མི་ཤེས་པ་འབྱུང་བའོ།
en: Great king, that which is called not conceiving of phenomena is the source of ignorance.

source: །གལ་ཏེ་འདུ་ཤེས་སུ་དམིགས་ན་འདུ་ཤེས་མ་ཡིན་པར་འགྱུར་རོ།
en: If you observe conceptualization, it becomes nonconceptualization.

source: །རྒྱལ་པོ་ཆེན་པོ་འདུ་ཤེས་གཞན་དུ་གྱུར་ན་འདུ་ཤེས་མ་ཡིན་པར་འགྱུར་ཏེ།
en: Great king, if conceptualization is transformed, it becomes nonconceptualization.

source: རྒྱལ་པོ་ཆེན་པོ་འདུ་ཤེས་ཞེས་བྱ་བ་འདི་ནི་བརྡའོ།
en: Great king, conceptualization is a symbolic designation.

source: །རྒྱལ་པོ་ཆེན་པོ་འདུ་ཤེས་ཞེས་བྱ་བ་འདི་ནི་ཆགས་པའོ།
en: Great king, conceptualization is attachment.

source: །རྒྱལ་པོ་ཆེན་པོ་འདུ་ཤེས་ཡོད་ན་བྱིས་པ་ཞེས་བྱའོ།
en: Great king, if there is conceptualization, it is called childishness.

source: །རྒྱལ་པོ་ཆེན་པོ་བྱིས་པ་ཞེས་བྱ་བ་ནི་བྱིས་པ་གནས་པར་བྱེད་པའོ།
en: Great king, childishness perpetuates childishness.

source: །ཅིའི་ཕྱིར་བྱིས་པ་གནས་པར་བྱེད་པ་ཞེས་བྱ་ཞེ་ན།
en: Why is it called perpetuating childishness?

source: བྱིས་པ་གནས་པར་བྱེད་པའི་ཕྱིར་རོ།
en: Because it perpetuates childishness.

source: །ཅི་ནས་གནས་པར་བྱེད་ཅེ་ན།
en: How is it perpetuated?

source: འདུ་ཤེས་གནས་པར་བྱེད་དོ།
en: It perpetuates conceptualization.

source: །འདུ་ཤེས་དེ་གང་ཞེ་ན།
en: What is that conceptualization?

source: འདི་ལྟ་སྟེ། བདག་ཏུ་འདུ་ཤེས་པ་དང་། སྲིད་པར་འདུ་ཤེས་པ་དང་། སེམས་ཅན་དུ་འདུ་ཤེས་པ་དང་། གཟུགས་སུ་འདུ་ཤེས་པ་ནས་རྣམ་པར་ཤེས་པར་འདུ་ཤེས་པའི་བར་དང་།
en: It is the perpetuation of the concept of a self, the concept of existence, the concept of a being, and everything from the concept of form up to the concept of consciousness.

source: མིག་ཏུ་འདུ་ཤེས་པ་དང་། རྣ་བར་འདུ་ཤེས་པ་དང་། སྣར་འདུ་ཤེས་པ་དང་། ལྕེར་འདུ་ཤེས་པ་དང་། ལུས་སུ་འདུ་ཤེས་པ་དང་། ཡིད་དུ་འདུ་ཤེས་པ་ནས་འདུ་ཤེས་ཐམས་ཅད་ཀྱི་བར་དུ་གནས་པར་བྱེད་ཅིང་། ཐ་ན་མྱ་ངན་ལས་འདས་པར་འདུ་ཤེས་པར་ཡང་གནས་པར་བྱེད་དོ། །
en: It is the perpetuation of everything from the concept of the eyes, ears, nose, tongue, body, and the mind up to all concepts, even as far as the concept of nirvāṇa.

source: རྒྱལ་པོ་ཆེན་པོ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་ཅིའི་ཕྱིར་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་ཞེ་ན།
en: Great king, why is nirvāṇa called nirvāṇa?

source: མྱ་ངན་ལས་འདས་པར་འདུ་ཤེས་པ་སྟེ།
en: Because it is a conceptualization of nirvāṇa. “

source: རྒྱལ་པོ་ཆེན་པོ་མྱ་ངན་ལས་འདས་པར་འདུ་ཤེས་པ་ནི་མེད་པའོ།
en: Great king, the concept of nirvāṇa does not exist.

source: །རྒྱལ་པོ་ཆེན་པོ་བྱིས་པ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་ནི་འཁོར་ལོའི་ཚུལ་དང་། ཆུ་ཀླུང་འཁྱིལ་པའི་ཚུལ་གྱིས་སོ།
en: Great king, for childish, ordinary beings, nirvāṇa is enacted in the manner of a wheel or a river eddy.

source: །རྒྱལ་པོ་ཆེན་པོ་ཚུལ་ཞེས་བྱ་བ་ཅིའི་ཕྱིར་ཚུལ་ཞེ་ན།
en: Great king, why is the term ‘manner’ used?

source: སྤྱོད་ཡུལ་མ་ཡིན་པ་སྟེ། གང་ན་སུའི་སྤྱོད་ཡུལ་ཡང་མ་ཡིན་པའོ།
en: Because it is not within the realm of experience. It cannot be the experience of anyone anywhere.

source: །སུའི་སྤྱོད་ཡུལ་ཡང་མ་ཡིན་པ་ནི་འདུ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་མ་ཡིན་པའོ།
en: Since it is not the experience of anyone, it is not in the realm of conceptualization.

source: །རྒྱལ་པོ་ཆེན་པོ་སྤྱོད་ཡུལ་ཞེས་བྱ་བ་ཅིའི་ཕྱིར་སྤྱོད་ཡུལ་ཞེས་བྱ་ཞེ་ན།
en: Great king, why is it called the realm of experience?

source: སེམས་དེ་དང་། སྤྱོད་པ་ཆེན་པོ་དེ་དང་། ཡང་དག་པ་མ་ཡིན་པའི་སྤྱོད་པ་སྦེད་པར་བྱེད་པའོ།
en: Because it conceals that mind, that great experience, and that inauthentic experience.

source: །ཡང་དག་པ་མ་ཡིན་པ་གང་ཞེ་ན།
en: What is inauthentic?

source: གང་དེ་ཁོ་ན་མ་ཡིན་པ་ནི་ཡང་དག་པ་མ་ཡིན་པའོ།
en: Anything that is not real is inauthentic.

source: །དེ་ལ་ཡོད་པ་མ་ཡིན་པ་ཞེས་བརྗོད་པ་ནི་ཐམས་ཅད་ཡང་དག་པ་མ་ཡིན་པ་སྟེ། དེས་ན་ཡོད་པ་མ་ཡིན་པ་ཞེས་བྱའོ།
en: Nonexistent things are all inauthentic, which is why they are called nonexistent.

source: །རྒྱལ་པོ་ཆེན་པོ་ཡོད་པ་མ་ཡིན་པ་ཞེས་བྱ་བ་ཅིའི་ཕྱིར་ཡོད་པ་མ་ཡིན་པ་ཞེས་བྱ་ཞེ་ན།
en: Great king, why are nonexistent things called nonexistent?

source: རྒྱལ་པོ་ཆེན་པོ་དངོས་པོ་མེད་དོ།
en: Because, great king, they lack substance.

source: །ཡང་དག་པ་མ་ཡིན་པ་ཅིའི་ཕྱིར་དངོས་པོ་མེད་ཅེ་ན།
en: Why do inauthentic things lack substance?

source: ཡང་དག་པ་མ་ཡིན་པ་ནི་མི་རྟག་པའོ། །ཡང་དག་པ་མ་ཡིན་པ་ནི་མི་སྡུག་པའོ། །ཡང་དག་པ་མ་ཡིན་པ་ནི་བདག་མེད་པའོ། །ཡང་དག་པ་མ་ཡིན་པ་ནི་སྲིད་པ་མི་གཙང་བའོ། །
en: Because inauthentic things are impermanent, because they are painful, because they lack a self, and because they are an impure reality.

source: གང་མི་དབེན་པ་དེ་ནི་ཡང་དག་པ་མ་ཡིན་པའོ།
en: Anything that is not true is inauthentic. “

source: །རྒྱལ་པོ་ཆེན་པོ་དེ་བཞིན་དུ་དེ་ནི་ཕྱིན་ཅི་ལོག་ཡིན་ནོ།
en: Likewise, great king, conceptualization is mistaken.

source: །ཅིའི་ཕྱིར་ཕྱིན་ཅི་ལོག་ཅེས་བྱ་ཞེ་ན།
en: Why is it called mistaken?

source: རྒྱལ་པོ་ཆེན་པོ་ཕྱིན་ཅི་ལོག་ནི་ཚུ་རོལ་ན་ཡང་མེད། ཕ་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མེད་ན།
en: Because, great king, what is mistaken is neither here, nor there, nor anywhere in between.

source: རྒྱལ་པོ་ཆེན་པོ་དེ་ནི་འདུ་ཤེས་ལྟ་ག་ལ་ཡོད།
en: Hence, great king, how could there be any conceptualization?

source: འདུ་ཤེས་དེ་གང་ཞེ་ན།
en: What is conceptualization?

source: མི་རྟག་པར་འདུ་ཤེས་པ་དང་། སྡུག་བསྔལ་བར་འདུ་ཤེས་པ་དང་། བདག་མེད་པར་འདུ་ཤེས་པ་དང་། མི་སྡུག་པར་འདུ་ཤེས་པའོ།
en: It is the conceptualization of impermanence, suffering, selflessness, and ugliness.

source: །རྒྱལ་པོ་ཆེན་པོ་ཅིའི་ཕྱིར་འདུ་ཤེས་ཚུ་རོལ་ན་ཡང་མེད། ཕ་རོལ་ན་ཡང་མེད། གཉི་གའི་བར་ན་ཡང་མེད་ཅེ་ན།
en: Great king, why is there no conceptualization here, there, or in between?

source: མི་རྟག་པར་འདུ་ཤེས་པ་ནི་རྟག་པ་ཁོ་ནར་འདུ་ཤེས་པར་ལྟོས་ཤིག །
en: Consider how the conceptualization of impermanence is just the same as the conceptualization of permanence! “

source: རྒྱལ་པོ་ཆེན་པོ་ཇི་སྐད་དུ་བསྟན་པར་འགྱུར་ཞེ་ན། གཉི་གའི་བར་ཞེས་བྱ་བ་ཅིའི་ཕྱིར་གཉི་གའི་བར་ཞེས་བྱ་ཞེ་ན།
en: Great king, in reference to what has been said, what is meant by in between?

source: རྒྱལ་པོ་ཆེན་པོ་གང་ན་བར་མེད་པ་དེ་ན་དབུས་ཀྱང་མི་དམིགས་ན་དེ་ལ་མཐར་ལྟ་ག་ལ་འགྱུར།
en: Great king, if there is no in-between, then one cannot determine the middle. How, then, could one determine the edge?

source: རྒྱལ་པོ་ཆེན་པོ་གང་ན་དབུས་མི་དམིགས་པ་དེ་ན་མཐའ་ཡང་མི་དམིགས་སོ།
en: Great king, where one cannot observe the middle, one cannot observe the edge.

source: །གང་ན་མཐའ་མི་དམིགས་པ་དེ་ན་འགྲོ་བ་ཡང་རྣམ་པར་ཆད་དོ།
en: If one cannot determine the edge, one has also eliminated movement.

source: །གང་ན་འགྲོ་བར་རྣམ་པར་ཆད་པ་དེ་ན་སུ་ཡང་སོང་བ་མེད་དོ།
en: Where movement is eliminated, no one can go.

source: །གང་ན་སུ་ཡང་སོང་བ་མེད་པ་དེ་ན་འགྲོ་བ་ཡང་མེད་དོ།
en: If no one can go, then no one will proceed.

source: །གང་ན་འགྲོ་བ་མེད་པ་དེ་ན་ཉིང་མཚམས་སྦྱོར་བ་མེད་དོ།
en: If no one can proceed, there can be no rebirth.

source: །གང་ཉིང་མཚམས་སྦྱོར་བ་མེད་པ་དེ་ནི་མཚམས་སྦྱོར་བ་སྟེ། བྱང་ཆུབ་དེ་ནི་གནས་པ་ཁོ་ནའོ།
en: Where there is no rebirth, the only continuation is the abode of awakening.

source: །བྱང་ཆུབ་གནས་པ་གང་ཡིན་པ་དེ་ནི་འཛིན་པ་མེད་པའོ།
en: The abode of awakening is devoid of grasping.

source: །འཛིན་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་སེམས་ཅན་ཞེས་བྱ་སྟེ།
en: Being devoid of grasping is called a sentient being.

source: དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་ཅན་གྱི་མཆོག་ཅེས་བརྗོད་དོ།
en: That is why bodhisattvas are known as supreme sentient beings.

source: །དེས་ན་བྱང་ཆུབ་སེམས་དཔའ་ནི་འཛིན་པ་མེད་པའོ།
en: Therefore, bodhisattvas are without grasping.

source: །ཅིའི་ཕྱིར་འཛིན་པ་མེད་ཅེ་ན།
en: Why is it called devoid of grasping?

source: དམིགས་པ་མི་འཛིན་པ་དེའི་ཕྱིར་འཛིན་པ་མེད་པ་ཞེས་བརྗོད་དེ།
en: It is known as devoid of grasping because there is no grasping at observations.

source: རྒྱལ་པོ་ཆེན་པོ་དེ་དག་ནི་ཆོས་ཀྱི་མཆོག་གོ།
en: Great king, that is the supreme teaching.

source: །དེ་ལྟར་ན་ཆོས་ཟབ་མོ་བསྟན་ཅིང་དེ་བཞིན་དུ་དེ་དག་བཤད་དེ།
en: In this way, I teach the profound Dharma and give explanations. “

source: འདི་ལྟར་མ་བྱས་པ། མ་བསྒྱུར་བ། མ་བཤིག་པ་སྟེ། ངོ་བོ་ཉིད་ཀྱིས་སྟོང་ངོ་།
en: In this way, phenomena are uncreated, unchanging, and unceasing; they are empty of essential nature.

source: །རྒྱལ་པོ་ཆེན་པོ་ངོ་བོ་ཉིད་ཅེས་བྱ་བ་ཅིའི་ཕྱིར་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་ཞེ་ན།
en: Great king, as for ‘essential nature,’ why do we speak of being empty of essential nature?

source: གང་བདག་གི་དངོས་པོ་མེད་པ་དེའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་ཞེས་བྱའོ།
en: It is because all phenomena lack intrinsic substance that they are said to be empty of essential nature.

source: །རྒྱལ་པོ་ཆེན་པོ་ཟབ་མོ་ཞེས་བྱ་བ་ཅིའི་ཕྱིར་ཟབ་མོ་ཞེས་བྱ་ཞེ་ན།
en: Great king, why is that Dharma known as profound?

source: རྒྱལ་པོ་ཆེན་པོ་བརྟན་པ་རྣམས་འཇུག་པའོ།
en: Because, great king, it leads to the stable states.

source: །རྒྱལ་པོ་ཆེན་པོ་བརྟན་པ་དག་གང་ཞེ་ན།
en: Great king, what are those stable states?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཏེ་དེ་དག་འཇུག་གོ།
en: They are states in which bodhisattva great beings engage.

source: །ཅིའི་ཕྱིར་འཇུག་ཅེ་ན།
en: What is meant by engage?

source: ཆོས་ཐམས་ཅད་སྟོང་པ་ལ་འཇུག་སྟེ། གང་དག་སྟོང་པ་ཉིད་ལ་འཇུག་པ་དེ་དག་འཇུག་སྟེ།
en: Engaging with all phenomena as being empty—whoever engages with emptiness understands that.

source: དེའི་ཕྱིར་ཆོས་ཐམས་ཅད་ནི་སྟོང་པ་ཉིད་ཅེས་བརྗོད་དོ།
en: That is why it is said that all phenomena are emptiness. “

source: །གཟུང་བར་བྱ་བ་མ་ཡིན་པ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པའོ།
en: As for saying that all phenomena are inconceivable, it means that they are devoid of characteristics.

source: །རྒྱལ་པོ་ཆེན་པོ་ཅིའི་ཕྱིར་མཚན་མ་མེད་ཅེ་ན།
en: Great king, why are they devoid of characteristics?

source: རྒྱལ་པོ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ནི་བདག་མེད་པ་སྟེ།
en: Great king, all phenomena are selfless.

source: གང་དག་བདག་མེད་པ་དེ་དག་ནི་བསྟན་དུ་མེད་པའོ།
en: What is selfless cannot be demonstrated.

source: །གང་དག་བསྟན་དུ་མེད་པ་དེ་དག་ནི་མི་འཁྲུགས་པའོ།
en: What cannot be demonstrated cannot be disturbed.

source: །གང་དག་མི་འཁྲུགས་པ་དེ་དག་ནི་གནས་པའོ།
en: What cannot be disturbed is grounded.

source: །གང་དག་གནས་པ་དེ་དག་ནི་མ་བསྒྲུབས་པའོ།
en: What is grounded is unestablished.

source: །གང་དག་མ་བསྒྲུབས་པ་དེ་དག་ནི་ཆུད་ཟོས་པ་མེད་པའོ།
en: What is unestablished will not be squandered.

source: །གང་དག་ཆུད་ཟོས་པ་མེད་པ་དེ་ནི་ཆོས་རྣམས་ཀྱི་ཆོས་ཀྱི་དབྱིངས་གནས་པ་ཞེས་བྱའོ།
en: What will not be squandered is known as all phenomena’s abiding realm of phenomena. “

source: །རྒྱལ་པོ་ཆེན་པོ་ཆོས་ཀྱི་དབྱིངས་གནས་པ་ཞེས་བྱ་བ་ཅིའི་ཕྱིར་ཆོས་གནས་པ་ཞེས་བྱ་ཞེ་ན།
en: Great king why is the abiding realm of phenomena known as abiding phenomena?

source: རྒྱལ་པོ་ཆེན་པོ་ཆོས་ནི་གནས་མེད་པའོ།
en: Great king, phenomena do not abide.

source: །གནས་མེད་པ་ཞེས་བྱ་བ་དེ་ནི་དང་པོ་ཉིད་ནས་མི་དམིགས་ལ་དང་པོ་ཉིད་ཀྱང་མི་དམིགས་སོ།
en: That ‘nonabiding’ has been unobservable since the very beginning, and even the beginning is unobservable.

source: །གང་དག་གི་གནས་མི་དམིགས་པ་དེ་དག་གི་འགྲོ་བ་ཡང་མེད་དོ། །འོང་བ་ཡང་མེད་དོ། །
en: What is without an observable basis is also without observable going or coming.

source: གང་གི་འོང་བ་མི་དམིགས་པ་དེ་ཐམས་ཅད་ནི་སྟོང་པའི་དབྱིངས་ཞེས་བྱའོ།
en: What is without an observable becoming is known as the space of emptiness.

source: །རྒྱལ་པོ་ཆེན་པོ་ཅིའི་ཕྱིར་དབྱིངས་མི་དམིགས་ཞེ་ན།
en: Great king, why is that space unobservable?

source: གལ་ཏེ་དབྱིངས་ལས་དབྱིངས་ཤིག་དམིགས་ན་དབྱིངས་དེ་ཉིད་དབྱིངས་སུ་འགྱུར་རོ།
en: If a space is observed within a space, it becomes the space itself.

source: །རྒྱལ་པོ་ཆེན་པོ་དེ་ལྟར་ན་བྱིས་པ་རྣམས་ནི་རྣམ་པར་ཐར་པ་ལ་རྒྱུག་གོ།
en: Great king, in that way, childish, ordinary beings will run toward liberation.

source: །རྒྱལ་པོ་ཆེན་པོ་རྣམ་པར་ཐར་པ་ཞེས་བྱ་བ་ཅིའི་ཕྱིར་རྣམ་པར་ཐར་པ་ཞེས་བྱ་ཞེ་ན།
en: Great king, why is it called liberation?

source: རྣམ་པར་ཐར་པ་ནི་ཟད་པ་མེད་པའོ།
en: Liberation is inexhaustible.

source: །གང་དག་ཟད་པ་མེད་པ་ལ་རྒྱུག་པ་དེ་དག་ནི་ཟད་པར་འགྱུར་རོ།
en: Those who run toward the inexhaustible will become exhausted.

source: །གང་དག་ཟད་པར་འགྱུར་བ་དེ་དག་ནི་ཡོངས་སུ་ཟད་པར་འགྱུར་རོ།
en: Those who are exhausted will become utterly exhausted.

source: །གང་དག་ཡོངས་སུ་ཟད་པར་འགྱུར་བ་དེ་དག་ནི་ཡོངས་སུ་ཉམས་པར་འགྱུར་རོ།
en: Those who become utterly exhausted are weakened.

source: །ཇི་ལྟར་ཡོངས་སུ་ཉམས་པར་འགྱུར་ཞེ་ན།
en: How are they weakened?

source: རང་བཞིན་ལས་ཡོངས་སུ་ཉམས་པར་འགྱུར་ཏེ།
en: They are weakened with respect to the true nature.

source: གང་དག་ཡོངས་སུ་ཉམས་པར་འགྱུར་བ་དེ་དག་གི་རྣམ་པར་ཐར་པའི་སྒོ་ནི་ཐག་རིང་ངོ་།
en: Those who are weakened are distant from the gateways to liberation.

source: །རྒྱལ་པོ་ཆེན་པོ་སྒོ་ཞེས་བྱ་བ་ཅིའི་ཕྱིར་སྒོ་ཞེས་བརྗོད་ཅེ་ན།
en: Great king, why are they called gateways?

source: གཉིས་ལ་ཀུན་ནས་དགའ་བ་དེའི་ཕྱིར་སྒོའོ།
en: They are gateways because they are well disposed toward two sides.

source: །རྒྱལ་པོ་ཆེན་པོ་རྣམ་པར་ཐར་པའི་སྒོ་ཞེས་བྱ་བ་འདི་ནི་ལྡེམ་པོ་ངག་གོ།
en: Great king, this use of the term gateway of liberation is a symbolic expression.

source: །རྒྱལ་པོ་ཆེན་པོ་ལྡེམ་པོ་ངག་ཅེས་བྱ་བ་ཅིའི་ཕྱིར་ལྡེམ་པོ་ངག་ཅེས་བྱ་ཞེ་ན།
en: Great king, why is it called a symbolic expression?

source: འདི་ལ་ངག་ཆུང་ཟད་ཀྱང་མེད་ལ་དེ་ལ་ཤེས་པར་བྱ་བ་ཡང་མེད་དོ།
en: Because in this there is nothing whatsoever to express and nothing to understand.

source: །གང་ལ་ཤེས་པར་བྱ་བ་མེད་པ་དེ་ནི་རྣམ་པར་ཤེས་པར་བྱ་བ་མ་ཡིན་ནོ།
en: Where there is nothing to be understood, there is also nothing to cognize. “

source: །རྒྱལ་པོ་ཆེན་པོ་རིགས་པ་མ་ཡིན་པ་མི་རིགས་པ་ཞེས་བྱ་བ་ཅིའི་ཕྱིར་རིགས་པ་མ་ཡིན་པ་ཞེ་ན།
en: Great king, why do we say that an unsuited person with no reasoning is unsuited?

source: ལེན་ཅིང་འདོར་བར་བྱེད་པའི་ཕྱིར་རོ།
en: Because they accept and reject.

source: །ཅི་ཞིག་ལེན་ཅིང་འདོར་བར་བྱེད་ཅེ་ན།
en: How do they accept and reject?

source: གང་ན་ལེན་པ་མེད་ཅིང་འདོར་བ་མེད་པའོ།
en: They accept and reject where there is nothing to accept and nothing to reject.

source: །གང་དག་འདོར་བ་དེ་དག་ནི་རྣམ་པར་རྒྱུག་པའོ།
en: Those who reject are running.

source: །གང་དུ་རྣམ་པར་རྒྱུག་ཅེ་ན།
en: Where are they running to?

source: བྱང་ཆུབ་ལ་རྣམ་པར་རྒྱུག་གོ།
en: They are running toward awakening.

source: །སྟོང་པ་ཉིད་ལ་རྣམ་པར་རྒྱུག་གོ།
en: They are running toward emptiness.

source: །རྣམ་པར་རྒྱུག་པ་དེ་དག་ནི་བསྟན་པ་འདི་དང་བྱང་ཆུབ་དང་ཉེ་བ་ལས་དེ་དག་ཐག་རིང་ངོ་།
en: Those who are running are distant from this teaching and far from being near to awakening.

source: །རྒྱལ་པོ་ཆེན་པོ་ཉེ་བ་ཞེས་བྱ་བ་ཅིའི་ཕྱིར་ཉེ་བ་ཞེས་བྱ་ཞེ་ན།
en: Great king, why is it called being near?

source: བྱང་ཆུབ་དང་ཉེ་བ་ཡང་མ་ཡིན། མི་ཉེ་བ་ཡང་མ་ཡིན་པའོ།
en: It is neither near to awakening nor not near to it.

source: །གང་བྱང་ཆུབ་གང་ལ་བཀོད་པ་ཡོད་པ་མ་ཡིན་པ་དེའི་ཕྱིར་ཉེ་བར་ཞི་བ་དང་།
en: What is awakened is not established anywhere.

source: ཉེ་བར་ཞི་བ་མ་ཡིན་པ་ཞེས་བརྗོད་པར་མི་བྱའོ།
en: Therefore, it is not known as either peace or nonpeace.

source: །རྒྱལ་པོ་ཆེན་པོ་ཉེ་བར་ཞི་བ་ཞེས་བྱ་བ་དང་། བྱང་ཆུབ་ཅེས་བྱ་བ་ཅིའི་ཕྱིར་བྱང་ཆུབ་ཅེས་བྱ་ཞེ་ན།
en: Great king, why are those who are at peace and awakened called awakened?

source: སེང་གེའི་ཕྱིར་རོ།
en: Because they are lions.

source: །སེང་གེ་གང་ཞེ་ན།
en: What is a ‘lion’?

source: བག་ཚ་བ་མེད་པའོ།
en: It is to be unafraid.

source: །ཅིའི་ཕྱིར་བག་ཚ་བ་མེད་པ་ཞེས་བརྗོད་ཅེ་ན།
en: Why are they said to be unafraid?

source: རྒྱལ་པོ་ཆེན་པོ་བག་ཚ་བ་ནི་འདས་པ་ཞེས་བརྗོད་དོ།
en: Because, great king, they have transcended fear.

source: །གང་བག་ཚ་བ་མེད་པ་དེ་དག་ལ་ཅིའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེ་བཞིན་གཤེགས་པ་ཞེས་བརྗོད་ཅེ་ན།
en: Great king, with regard to those who are unafraid, why are thus-gone ones called thus-gone ones?

source: འགྲོ་བ་དང་འོང་བ་སྟེ། དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེ་བཞིན་གཤེགས་པ་ཞེས་བརྗོད་དོ།
en: Thus-gone ones are called thus-gone ones because they come and go.

source: །རྒྱལ་པོ་ཆེན་པོ་གཞན་ཡང་ཅིའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་ཞེ་ན།
en: Great king, why else are they called thus-gone ones?

source: འདི་ལྟར་སོང་བ་ཡང་མེད། མ་སོང་བ་ཡང་མེད་པ་དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཞེས་བརྗོད་དོ།
en: Because they have not gone, nor have they not gone. That is why they are called thus-gone ones.

source: །རྒྱལ་པོ་ཆེན་པོ་སངས་རྒྱས་ཀྱི་བགྲོ་བ་ཞེས་བརྗོད་པ་དེ་ཅིའི་ཕྱིར་སངས་རྒྱས་ཀྱི་བགྲོ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་བགྲོ་བ་ཞེས་བརྗོད་ཅེ་ན།
en: Great king, why are discussions about buddhas known as discussions about buddhas and discussions about thus-gone ones?

source: ཆོས་ཐམས་ཅད་འགྲོ་བ་མེད་པར་དེས་རྟོགས་པའི་ཕྱིར་རོ།
en: Because buddhas understand that all phenomena are unmoving.

source: །ཇི་ལྟར་རྟོགས་ཞེ་ན།
en: How do they understand that?

source: འགྲོ་བ་དང་འོང་བ་མེད་པ་ཇི་ལྟར་རྟོགས་པ་དེ་ལྟར་རྟོགས་པའི་ཕྱིར་རོ།
en: They understand it in the same way they understand that there is no coming and no going.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཡུལ་ཀོ་ས་ལའི་རྒྱལ་པོ་གསལ་རྒྱལ་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་ཟབ་མོ་འདི་ནི་ངོ་མཚར་ལགས་སོ།
en: King Prasenajit of Kośala said to the Blessed One, “Blessed One, this profound Dharma teaching is amazing!

source: །བཅོམ་ལྡན་འདས་ཆོས་འདི་བསྟན་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བའི་སེམས་ཅན་ནི་ཇི་སྙེད་ཅིག་མཆིས་ལགས།
en: Blessed One, how many beings will depart to unexcelled and perfect awakening through this teaching?

source: ཉན་ཐོས་ཀྱི་གནས་ལ་གནས་པ་ནི་ཇི་སྙེད་ཅིག་མཆིས་ལགས།
en: How many will dwell in the state of the hearers?

source: རང་སངས་རྒྱས་ཀྱི་གནས་ལ་གནས་པ་ནི་ཇི་སྙེད་ཅིག་མཆིས་ལགས།
en: How many will dwell in the state of the solitary buddhas?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་འདི་ལྟར་ང་འཆད་པ་གང་ཡིན་པ་དང་། འཆད་པར་འགྱུར་བ་གང་ཡིན་པ་དང་། ངས་ཆོས་བཤད་པ་གང་ཡིན་པ་དང་།
en: The Blessed One said, “Great king, there are no beings whatsoever who will depart because of the teachings that I am explaining, those I will explain, and those that I have explained.

source: ཆོས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་གང་ཡིན་པའི་ཆོས་བསྟན་པ་འདི་ལ་ནི་སེམས་ཅན་ངེས་པར་འབྱུང་བ་གང་ཡང་མེད་དོ།
en: There are no beings whatsoever who will depart because of this Dharma teaching about the perfect awakening of phenomena.

source: །ཉན་ཐོས་ཀྱི་ཕྱིར་གནས་པ་མ་ཡིན་ནོ། །རང་སངས་རྒྱས་ཀྱི་ཕྱིར་གནས་པ་མ་ཡིན་ནོ།
en: There are none who will dwell in the state of the hearers and none who will dwell in the state of solitary buddhas.

source: །རྒྱལ་པོ་ཆེན་པོ་འདི་ལྟ་སྟེ། དཔེར་ན་སྒྱུ་མ་མཁན་ནམ། སྒྱུ་མ་མཁན་གྱི་སློབ་མ་མཁས་པ་ཞིག་གིས་སྐྱེ་བོ་ཕལ་པོ་ཆེའི་མདུན་དུ་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་མངོན་པར་སྤྲུལ་ཏེ། ཤོམ་ཞིང་གོ་ཆ་བསྐོན་ལ། རྒྱལ་པོ་གཉིས་གཡུལ་འགྱེད་པར་སྡུད་པ་ལས།
en: Great king, it is like this analogy: Imagine that in the presence of a group of people a magician or a magician’s skilled apprentice conjures up two kings with armies of the four kinds of troops, fully prepared and armored, who are assembled to fight a battle.

source: རྒྱལ་པོ་ཆེན་པོ་དེ་ལ་སྒྱུ་མ་མཁན་གྱིས་སྤྲུལ་པའི་རྒྱལ་པོ་གཉིས་ལས། དེ་ལ་རྒྱལ་པོ་གཅིག་ནི་ཕམ་པར་གྱུར། དེ་ལ་རྒྱལ་པོ་ཅིག་ཤོས་གང་ཡིན་པ་དེ་ནི་སྤྲུལ་པའི་གཡུལ་དེར་གཡུལ་བཀྱེ་བ་ལས་སྤྲུལ་པའི་རྒྱལ་པོ་དེ་རྒྱལ་ནས།
en: Great king, one of those two kings conjured by the magician is then defeated, and the other king, after that conjured battle has been fought, emerges victorious.

source: དེ་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པོ་དེའི་མདུན་དུ་ཚིག་འདི་སྐད་ཅེས་ངས་རྒྱལ་པོ་ཆེན་པོ་ཕམ་པར་བྱས་སོ།
en: In front of that army of the four kinds of troops, he then says, ‘I defeated the great king! I removed the thorn!’

source: །ངས་ཚེར་མ་ཕྱུང་ངོ་ཞེས་སྨྲ་ན་རྒྱལ་པོ་ཆེན་པོ་འདི་ཇི་སྙམ་དུ་སེམས།
en: What do you think, great king?

source: རྒྱལ་པོ་ཕམ་པ་དེ་ཅི་འདྲ་བ་ཞིག་ཡིན།
en: What is the defeated king like?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་སྒྱུ་མ་མཁན་གྱིས་སྤྲུལ་པའི་རྒྱལ་པོས་སྒྱུ་མ་མཁན་གྱིས་སྤྲུལ་པ་ཕམ་པར་བགྱིས་སོ། །
en: Blessed One, the king conjured by a magician was defeated by the king conjured by a magician.”

source: བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་སྤྲུལ་པས་སྤྲུལ་པ་འགའ་ཞིག་ཕམ་པར་བྱེད་དམ།
en: The Blessed One said, “Great king, do certain emanations defeat other emanations?” “

source: སྤྲུལ་པའི་མཐུ་གང་ལགས་པ་དེ་ནི་དངོས་པོ་མ་མཆིས་པ་ལགས་ཏེ། དངོས་པོ་མ་མཆིས་པས་དངོས་པོ་མ་མཆིས་པ་ཕམ་པར་བགྱིད་པ་མ་མཆིས་པའི་སླད་དུའོ།
en: Because the ability of an emanation is not a substantial thing, and an insubstantial thing cannot defeat an insubstantial thing.

source: །བཅོམ་ལྡན་འདས་རྒྱལ་པོ་ཕམ་པ་འདི་དང་། རྒྱལ་པོ་འདི་ཞེས་བགྱི་བ་དེ་ནི་བྱིས་པ་རྣམས་ཀྱི་རྨོངས་པ་ལགས་སོ།
en: Blessed One, the defeated king and the words of the king are a delusion of childish, ordinary beings.”

source: །བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་དེ་བཞིན་དུ་གང་ཆོས་རྣམས་ཀྱི་རང་བཞིན་དེ་ལ་ཡང་ཕམ་པ་དང་། མ་ཕམ་པ་མེད་དེ།
en: The Blessed One said, “Great king, in that same way, the nature of phenomena is beyond defeat and no defeat.

source: ཆོས་འདི་ནི་གནས་པ་ཁོ་ན་སྟེ།
en: This Dharma is the natural way.

source: ཆོས་ཀྱི་དབྱིངས་ནི་གནས་པ་ཉིད་དོ།
en: The realm of phenomena is things as they are.

source: །ཆོས་སྐྱོན་མེད་པ་ཉིད་དོ།
en: This Dharma is the very absence of flaws.

source: །དེ་ལ་དེ་བཞིན་གཤེགས་པ་ནི་ཡང་དག་པར་སྨྲ་བ།
en: In this regard, the thus-gone ones speak the truth.

source: དེ་བཞིན་དུ་སྨྲ་བ།
en: They speak just as it is.

source: ཕྱིན་ཅི་མ་ལོག་པར་སྨྲ་བ།
en: They speak correctly.

source: གཞན་མ་ཡིན་པ་སྨྲ་བ་སྟེ།
en: They speak incontrovertibly.

source: ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་པར་རྗེས་སུ་ཐ་སྙད་འདོགས་སོ།
en: They apply terms in accordance with the unborn nature of all phenomena.

source: །རྒྱལ་པོ་ཆེན་པོ་བྱིས་པ་རྣམས་ཇི་ལྟར་འཛིན་པ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་ནི་བསྟན་དུ་མེད་པ་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: Great king, in accordance with the way in which childish, ordinary beings apprehend, the thus-gone ones teach what cannot be demonstrated.

source: །རྒྱལ་པོ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པ་ནི་ཐ་སྙད་ཐམས་ཅད་ཡང་དག་པར་ཆད་པའོ།
en: Great king, the thus-gone ones completely eliminate all conventions.

source: །ཅིའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཐ་སྙད་ཐམས་ཅད་ཡང་དག་པར་ཆད་པ་ཞེས་བརྗོད་ཅེ་ན།
en: Why do thus-gone ones completely eliminate all conventions?

source: ཐ་སྙད་ཐམས་ཅད་མཚུངས་པའི་ཕྱིར་རོ།
en: Because all conventions are equal.

source: །གང་མཚུངས་པ་དེ་ནི་ཆད་པ་སྟེ། གང་ཆད་པ་དེ་ལ་མཚུངས་པ་ཞེས་བརྗོད་དེ།
en: It is said that what is equal is eliminated, and what is eliminated is equal.

source: ཐ་སྙད་དེ་ཐམས་ཅད་ཡང་དག་པར་ཆད་པ་དེ་ནི་ཆོས་རྣམས་སྐྱེ་བ་མེད་པའོ།
en: The complete elimination of all conventions is the unborn nature of phenomena. “

source: །རྒྱལ་པོ་ཆེན་པོ་འདི་ལྟར་རྩིས་ཀྱི་དྲུང་ཇི་ལྟར་བཞག་པ་དེ་ལྟར་བསྟན་པར་བྱ་སྟེ།
en: Great king, this can be shown in the way that a mathematician operates.

source: རྒྱལ་པོ་ཆེན་པོ་འདི་ལྟ་སྟེ། དཔེར་ན་འབུམ་ཕྲག་གཅིག་ལས་བྱེ་བ་མང་པོར་སྟོན་པ་ནི་འབུམ་ཕྲག་དེ་ལས་བྱེ་བ་དག་བྱུང་བའོ།
en: For example, great king, from one hundred thousand, many millions can be made. Those millions arose from that hundred thousand.

source: །རྒྱལ་པོ་ཆེན་པོ་འདི་ལྟ་སྟེ། དཔེར་ན་མེ་ལོང་གི་དཀྱིལ་འཁོར་གཅིག་གི་ནང་ན་གཟུགས་བརྙན་མང་པོ་སྣང་ཡང་མེ་ལོང་གི་དཀྱིལ་འཁོར་དེ་ལ་གཟུགས་བརྙན་དེ་དག་མེད་དོ།
en: Moreover, great king, even though many reflections appear in a mirror, those reflections do not exist in the mirror.
